Revit 2027 API
Application.ShowGraphicalWarningHangerDisconnects Property
 Whether or not to show the graphical warnings for Fabrication Hanger disconnects.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGraphicalWarningHangerDisconnects { get; set; }
Public Property ShowGraphicalWarningHangerDisconnects As Boolean
	Get
	Set
public:
property bool ShowGraphicalWarningHangerDisconnects {
	bool get ();
	void set (bool value);
}
member ShowGraphicalWarningHangerDisconnects : bool with get, set
Property Value
Boolean
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace